packages/inductiva/inductiva-0.3.9.tar.gz/inductiva-0.3.9/inductiva/templates/heat_sink/openfoam/sim_config_files/constant/heater/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/heater";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    // heater

    specie
    {
        molWeight       63.5;
    }
    equationOfState
    {
        rho             8940;
    }
    transport
    {
        kappa           380;
    }
    thermodynamics
    {
        Hf              0;
        Cv              385;
    }
}

// ************************************************************************* //
